//WFMPROC  PROC PG=,PM=,SPL=256,SPU=VIO,SPS='TRK,(5,25)'
//* General JCL proc supplied with WFM v012
//GO       EXEC PGM=IKJEFT1B,PARM='&PG &PM'
//STEPLIB  INCLUDE MEMBER=WFMSTEPL
//SYSEXEC  DD DISP=SHR,DSN=&WFMLIB
//WFMLIB   DD DISP=SHR,DSN=&WFMLIB
//WFMSETLB DD DISP=SHR,DSN=&WFMSETLB
//WFMDB    DD DISP=SHR,DSN=&WFMDB
//VOLSEL   DD DISP=SHR,DSN=&WFMSETLB.(VOLSEL)
//WFMWRK1  DD RECFM=VB,LRECL=&SPL,BLKSIZE=0,SPACE=(&SPS),UNIT=&SPU
//SYSOUT   DD SYSOUT=*
//TOOLMSG  DD SYSOUT=*
//DFSMSG   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD DUMMY
//         PEND
