//* In-stream rexx
//WFMRXINS PROC P='',PM='',EXEC1=&WFMLIB,EXEC2=&WFMLIB
//R        EXEC PGM=IKJEFT1B,PARM='WFMRXINX &P &PM',DYNAMNBR=200
//STEPLIB  INCLUDE MEMBER=WFMSTEPL
//SYSEXEC  DD DISP=SHR,DSN=&EXEC1
//         DD DISP=SHR,DSN=&EXEC2
//WFMLIB   DD DISP=SHR,DSN=&WFMLIB
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD DUMMY
//REXX     DD DDNAME=SYSIN
//         PEND
